Pythonデータサイエンスハンドブック

In [ ]:
import numpy as np
import pandas as pd

In [1]:
a = np.array([100,200,300,400])

NameError: name 'np' is not defined

In [ ]:
a*8

array([ 800, 1600, 2400, 3200])

In [15]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [16]:
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [17]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [19]:
states = pd.DataFrame({'population':population,'area':area})

In [22]:
states

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>population</th>
      <th>area</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>California</th>
      <td>38332521</td>
      <td>423967</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>26448193</td>
      <td>695662</td>
    </tr>
    <tr>
      <th>New York</th>
      <td>19651127</td>
      <td>141297</td>
    </tr>
    <tr>
      <th>Florida</th>
      <td>19552860</td>
      <td>170312</td>
    </tr>
    <tr>
      <th>Illinois</th>
      <td>12882135</td>
      <td>149995</td>
    </tr>
  </tbody>
</table>
</div>

In [21]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [24]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [44]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,20,6))
ser

0     6
1    19
2    14
3    10
4     7
5     6
dtype: int32

In [50]:

df = pd.DataFrame(rng.randint(0,2000,(10,10)),columns=['A','B','C','D','E','F','G','H','I','J'])
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>A</th>
      <th>B</th>
      <th>C</th>
      <th>D</th>
      <th>E</th>
      <th>F</th>
      <th>G</th>
      <th>H</th>
      <th>I</th>
      <th>J</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>154</td>
      <td>489</td>
      <td>1409</td>
      <td>784</td>
      <td>1127</td>
      <td>1952</td>
      <td>1416</td>
      <td>1834</td>
      <td>245</td>
      <td>1199</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1062</td>
      <td>1500</td>
      <td>1705</td>
      <td>758</td>
      <td>537</td>
      <td>1890</td>
      <td>1841</td>
      <td>920</td>
      <td>407</td>
      <td>524</td>
    </tr>
    <tr>
      <th>2</th>
      <td>827</td>
      <td>1529</td>
      <td>902</td>
      <td>1848</td>
      <td>35</td>
      <td>684</td>
      <td>19</td>
      <td>320</td>
      <td>1799</td>
      <td>511</td>
    </tr>
    <tr>
      <th>3</th>
      <td>399</td>
      <td>653</td>
      <td>971</td>
      <td>1906</td>
      <td>470</td>
      <td>1166</td>
      <td>1115</td>
      <td>1377</td>
      <td>833</td>
      <td>1823</td>
    </tr>
    <tr>
      <th>4</th>
      <td>726</td>
      <td>1982</td>
      <td>853</td>
      <td>50</td>
      <td>1688</td>
      <td>1721</td>
      <td>574</td>
      <td>1213</td>
      <td>1148</td>
      <td>149</td>
    </tr>
    <tr>
      <th>5</th>
      <td>313</td>
      <td>569</td>
      <td>1365</td>
      <td>304</td>
      <td>1715</td>
      <td>681</td>
      <td>837</td>
      <td>1806</td>
      <td>1077</td>
      <td>1002</td>
    </tr>
    <tr>
      <th>6</th>
      <td>443</td>
      <td>612</td>
      <td>992</td>
      <td>263</td>
      <td>1076</td>
      <td>1595</td>
      <td>1003</td>
      <td>1643</td>
      <td>4</td>
      <td>1126</td>
    </tr>
    <tr>
      <th>7</th>
      <td>1219</td>
      <td>773</td>
      <td>876</td>
      <td>991</td>
      <td>883</td>
      <td>1373</td>
      <td>46</td>
      <td>866</td>
      <td>822</td>
      <td>935</td>
    </tr>
    <tr>
      <th>8</th>
      <td>1843</td>
      <td>655</td>
      <td>268</td>
      <td>369</td>
      <td>635</td>
      <td>1129</td>
      <td>1693</td>
      <td>1682</td>
      <td>656</td>
      <td>119</td>
    </tr>
    <tr>
      <th>9</th>
      <td>830</td>
      <td>1810</td>
      <td>1627</td>
      <td>1081</td>
      <td>1974</td>
      <td>1369</td>
      <td>740</td>
      <td>1497</td>
      <td>116</td>
      <td>1853</td>
    </tr>
  </tbody>
</table>
</div>